benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_NVIDIA_Nemotron_3_Nano_30B_A3B_FP8_text_only_20260129_043248.txt
##############################################################
# vLLM TEXT-ONLY BENCHMARK RESULTS
##############################################################

DEVICE INFO
-----------
Device (raw):       NVIDIA GB10
Device (sanitized): NVIDIA_GB10
NVIDIA GB10, [N/A], 580.95.05, 12.1

METADATA
--------
Date:            Thu Jan 29 04:32:48 AM UTC 2026
Hostname:        spark-ff62
Model:           nvidia/NVIDIA-Nemotron-3-Nano-30B-A3B-FP8
Test Type:       Text-Only
Num Prompts:     100
Max Concurrency: 10
Num Warmups:     10
Input Length:    1000 (±0.3)
Output Length:   300 (±0.3)
Seed:            42

##############################################################
# TEST RESULTS
##############################################################

============================================================
TEST: Text-Only Benchmark
Started: Thu Jan 29 04:32:48 AM UTC 2026
============================================================

Script started on 2026-01-29 04:32:48+00:00 [COMMAND="docker run -t --rm --network host         nvcr.io/nvidia/vllm:25.12.post1-py3         vllm bench serve         --backend openai-chat         --model "nvidia/NVIDIA-Nemotron-3-Nano-30B-A3B-FP8"         --endpoint /v1/chat/completions         --base-url http://localhost:8000         --dataset-name random         --num-prompts 100         --max-concurrency 10         --num-warmups 10         --random-prefix-len 0         --random-input-len 1000         --random-output-len 300         --random-range-ratio 0.3         --request-rate inf         --ignore-eos         --seed 42" TERM="xterm-256color" TTY="/dev/pts/13" COLUMNS="109" LINES="21"]

==========
== vLLM ==
==========

NVIDIA Release 25.12.post1 (build 247811356)
vLLM Version 0.12.0+35a9f223
Container image Copyright (c) 2025, NVIDIA CORPORATION & AFFILIATES. All rights reserved.

Various files include modifications (c) NVIDIA CORPORATION & AFFILIATES.  All rights reserved.

GOVERNING TERMS: The software and materials are governed by the NVIDIA Software License Agreement
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/nvidia-software-license-agreement/)
and the Product-Specific Terms for NVIDIA AI Products
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/product-specific-terms-for-ai-products/).

WARNING: The NVIDIA Driver was not detected.  GPU functionality will not be available.
   Use the NVIDIA Container Toolkit to start this container with GPU support; see
   https://docs.nvidia.com/datacenter/cloud-native/ .

NOTE: The SHMEM allocation limit is set to the default of 64MB.  This may be
   insufficient for vLLM.  NVIDIA recommends the use of the following flags:
   docker run --gpus all --ipc=host --ulimit memlock=-1 --ulimit stack=67108864 ...

/usr/local/lib/python3.12/dist-packages/torchvision/io/image.py:14: UserWarning: Failed to load image Python extension: 'Could not load this library: /usr/local/lib/python3.12/dist-packages/torchvision/image.so'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
INFO 01-29 04:32:50 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 01-29 04:32:50 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 01-29 04:32:50 [interface.py:221] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 01-29 04:32:51 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf20cedfb0e00>, seed=42, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=300, random_range_ratio=0.3, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=10, model='nvidia/NVIDIA-Nemotron-3-Nano-30B-A3B-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=10, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-8d476070-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
tokenizer_config.json: 0.00B [00:00, ?B/s]tokenizer_config.json: 188kB [00:00, 415MB/s]
tokenizer.json:   0%|                                                            | 0.00/17.1M [00:00<?, ?B/s]tokenizer.json:   1%|▍                                                   | 131k/17.1M [00:01<02:58, 94.9kB/s]tokenizer.json: 100%|███████████████████████████████████████████████████| 17.1M/17.1M [00:01<00:00, 12.3MB/s]
special_tokens_map.json:   0%|                                                     | 0.00/420 [00:00<?, ?B/s]special_tokens_map.json: 100%|██████████████████████████████████████████████| 420/420 [00:00<00:00, 6.31MB/s]
chat_template.jinja: 0.00B [00:00, ?B/s]chat_template.jinja: 10.5kB [00:00, 87.8MB/s]
INFO 01-29 04:32:56 [datasets.py:613] Sampling input_len from [700, 1300] and output_len from [210, 390]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |                                                                               | 00:00 elapsed, ? remaining |                                                                           | 00:00 elapsed, 00:04 remaining |                                                                      | 00:08 elapsed, 1457:26:56 remaining
Initial test run completed.
Warming up with 10 requests...
  0%|                                                                                 | 0/10 [00:00<?, ?it/s] 10%|███████▎                                                                 | 1/10 [00:14<02:13, 14.87s/it] 20%|██████████████▌                                                          | 2/10 [00:15<00:50,  6.32s/it] 40%|█████████████████████████████▏                                           | 4/10 [00:15<00:14,  2.46s/it] 90%|█████████████████████████████████████████████████████████████████▋       | 9/10 [00:24<00:02,  2.04s/it]100%|████████████████████████████████████████████████████████████████████████| 10/10 [00:24<00:00,  2.48s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 10
  0%|                                                                                | 0/100 [00:00<?, ?it/s]  1%|▋                                                                       | 1/100 [00:12<20:34, 12.47s/it]  2%|█▍                                                                      | 2/100 [00:14<10:21,  6.34s/it]  3%|██▏                                                                     | 3/100 [00:19<09:08,  5.65s/it]  4%|██▉                                                                     | 4/100 [00:20<06:19,  3.95s/it]  5%|███▌                                                                    | 5/100 [00:21<04:13,  2.67s/it]  6%|████▎                                                                   | 6/100 [00:21<02:59,  1.91s/it]  8%|█████▊                                                                  | 8/100 [00:22<01:52,  1.22s/it]  9%|██████▍                                                                 | 9/100 [00:32<05:11,  3.42s/it] 10%|███████                                                                | 10/100 [00:33<04:03,  2.71s/it] 11%|███████▊                                                               | 11/100 [00:35<03:56,  2.65s/it] 12%|████████▌                                                              | 12/100 [00:38<04:08,  2.83s/it] 13%|█████████▏                                                             | 13/100 [00:39<03:14,  2.24s/it] 14%|█████████▉                                                             | 14/100 [00:40<02:31,  1.77s/it] 15%|██████████▋                                                            | 15/100 [00:41<02:08,  1.51s/it] 16%|███████████▎                                                           | 16/100 [00:42<02:13,  1.60s/it] 17%|████████████                                                           | 17/100 [00:45<02:46,  2.01s/it] 18%|████████████▊                                                          | 18/100 [00:47<02:39,  1.94s/it] 19%|█████████████▍                                                         | 19/100 [00:51<03:16,  2.43s/it] 20%|██████████████▏                                                        | 20/100 [00:53<03:03,  2.30s/it] 21%|██████████████▉                                                        | 21/100 [00:57<03:40,  2.79s/it] 22%|███████████████▌                                                       | 22/100 [00:59<03:37,  2.79s/it] 23%|████████████████▎                                                      | 23/100 [01:00<02:44,  2.13s/it] 24%|█████████████████                                                      | 24/100 [01:01<02:05,  1.65s/it] 25%|█████████████████▊                                                     | 25/100 [01:04<02:51,  2.29s/it] 26%|██████████████████▍                                                    | 26/100 [01:06<02:34,  2.09s/it] 27%|███████████████████▏                                                   | 27/100 [01:08<02:21,  1.94s/it] 28%|███████████████████▉                                                   | 28/100 [01:13<03:43,  3.11s/it] 29%|████████████████████▌                                                  | 29/100 [01:15<03:18,  2.79s/it] 30%|█████████████████████▎                                                 | 30/100 [01:18<03:03,  2.63s/it] 31%|██████████████████████                                                 | 31/100 [01:19<02:29,  2.16s/it] 32%|██████████████████████▋                                                | 32/100 [01:19<01:51,  1.63s/it] 33%|███████████████████████▍                                               | 33/100 [01:20<01:28,  1.32s/it] 34%|████████████████████████▏                                              | 34/100 [01:25<02:39,  2.42s/it] 35%|████████████████████████▊                                              | 35/100 [01:29<03:04,  2.85s/it] 36%|█████████████████████████▌                                             | 36/100 [01:30<02:31,  2.36s/it] 37%|██████████████████████████▎                                            | 37/100 [01:31<02:09,  2.06s/it] 38%|██████████████████████████▉                                            | 38/100 [01:35<02:40,  2.59s/it] 39%|███████████████████████████▋                                           | 39/100 [01:36<01:59,  1.96s/it] 40%|████████████████████████████▍                                          | 40/100 [01:37<01:46,  1.77s/it] 41%|█████████████████████████████                                          | 41/100 [01:40<02:08,  2.17s/it] 42%|█████████████████████████████▊                                         | 42/100 [01:43<02:18,  2.39s/it] 43%|██████████████████████████████▌                                        | 43/100 [01:45<02:07,  2.24s/it] 44%|███████████████████████████████▏                                       | 44/100 [01:47<02:10,  2.33s/it] 45%|███████████████████████████████▉                                       | 45/100 [01:49<01:55,  2.10s/it] 46%|████████████████████████████████▋                                      | 46/100 [01:52<02:12,  2.46s/it] 47%|█████████████████████████████████▎                                     | 47/100 [01:55<02:16,  2.58s/it] 48%|██████████████████████████████████                                     | 48/100 [01:57<01:58,  2.29s/it] 49%|██████████████████████████████████▊                                    | 49/100 [01:58<01:41,  1.99s/it] 50%|███████████████████████████████████▌                                   | 50/100 [02:02<02:10,  2.60s/it] 51%|████████████████████████████████████▏                                  | 51/100 [02:03<01:49,  2.24s/it] 52%|████████████████████████████████████▉                                  | 52/100 [02:07<02:09,  2.69s/it] 53%|█████████████████████████████████████▋                                 | 53/100 [02:08<01:47,  2.28s/it] 54%|██████████████████████████████████████▎                                | 54/100 [02:12<02:00,  2.62s/it] 55%|███████████████████████████████████████                                | 55/100 [02:12<01:27,  1.95s/it] 56%|███████████████████████████████████████▊                               | 56/100 [02:13<01:12,  1.66s/it] 57%|████████████████████████████████████████▍                              | 57/100 [02:17<01:37,  2.27s/it] 58%|█████████████████████████████████████████▏                             | 58/100 [02:21<01:57,  2.80s/it] 59%|█████████████████████████████████████████▉                             | 59/100 [02:22<01:31,  2.24s/it] 60%|██████████████████████████████████████████▌                            | 60/100 [02:28<02:17,  3.44s/it] 61%|███████████████████████████████████████████▎                           | 61/100 [02:29<01:44,  2.67s/it] 62%|████████████████████████████████████████████                           | 62/100 [02:30<01:21,  2.15s/it] 63%|████████████████████████████████████████████▋                          | 63/100 [02:32<01:18,  2.12s/it] 64%|█████████████████████████████████████████████▍                         | 64/100 [02:32<00:58,  1.61s/it] 65%|██████████████████████████████████████████████▏                        | 65/100 [02:34<00:59,  1.71s/it] 66%|██████████████████████████████████████████████▊                        | 66/100 [02:38<01:18,  2.31s/it] 67%|███████████████████████████████████████████████▌                       | 67/100 [02:42<01:35,  2.90s/it] 68%|████████████████████████████████████████████████▎                      | 68/100 [02:43<01:10,  2.21s/it] 69%|████████████████████████████████████████████████▉                      | 69/100 [02:43<00:52,  1.68s/it] 70%|█████████████████████████████████████████████████▋                     | 70/100 [02:46<00:57,  1.90s/it] 71%|██████████████████████████████████████████████████▍                    | 71/100 [02:46<00:42,  1.47s/it] 72%|███████████████████████████████████████████████████                    | 72/100 [02:47<00:31,  1.14s/it] 73%|███████████████████████████████████████████████████▊                   | 73/100 [02:55<01:30,  3.34s/it] 74%|████████████████████████████████████████████████████▌                  | 74/100 [02:58<01:26,  3.33s/it] 75%|█████████████████████████████████████████████████████▎                 | 75/100 [03:00<01:09,  2.79s/it] 76%|█████████████████████████████████████████████████████▉                 | 76/100 [03:01<00:52,  2.19s/it] 77%|██████████████████████████████████████████████████████▋                | 77/100 [03:03<00:50,  2.21s/it] 78%|███████████████████████████████████████████████████████▍               | 78/100 [03:04<00:39,  1.80s/it] 79%|████████████████████████████████████████████████████████               | 79/100 [03:04<00:30,  1.45s/it] 80%|████████████████████████████████████████████████████████▊              | 80/100 [03:08<00:43,  2.20s/it] 81%|█████████████████████████████████████████████████████████▌             | 81/100 [03:12<00:52,  2.78s/it] 82%|██████████████████████████████████████████████████████████▏            | 82/100 [03:17<01:01,  3.43s/it] 83%|██████████████████████████████████████████████████████████▉            | 83/100 [03:18<00:43,  2.54s/it] 84%|███████████████████████████████████████████████████████████▋           | 84/100 [03:18<00:31,  1.95s/it] 85%|████████████████████████████████████████████████████████████▎          | 85/100 [03:21<00:31,  2.13s/it] 86%|█████████████████████████████████████████████████████████████          | 86/100 [03:21<00:22,  1.60s/it] 87%|█████████████████████████████████████████████████████████████▊         | 87/100 [03:22<00:16,  1.24s/it] 88%|██████████████████████████████████████████████████████████████▍        | 88/100 [03:26<00:24,  2.01s/it] 89%|███████████████████████████████████████████████████████████████▏       | 89/100 [03:28<00:25,  2.29s/it] 90%|███████████████████████████████████████████████████████████████▉       | 90/100 [03:34<00:32,  3.26s/it] 91%|████████████████████████████████████████████████████████████████▌      | 91/100 [03:37<00:29,  3.33s/it] 92%|█████████████████████████████████████████████████████████████████▎     | 92/100 [03:38<00:20,  2.54s/it] 93%|██████████████████████████████████████████████████████████████████     | 93/100 [03:39<00:13,  1.93s/it] 94%|██████████████████████████████████████████████████████████████████▋    | 94/100 [03:39<00:08,  1.46s/it] 95%|███████████████████████████████████████████████████████████████████▍   | 95/100 [03:40<00:07,  1.42s/it] 96%|████████████████████████████████████████████████████████████████████▏  | 96/100 [03:44<00:08,  2.06s/it] 97%|████████████████████████████████████████████████████████████████████▊  | 97/100 [03:44<00:04,  1.50s/it] 98%|█████████████████████████████████████████████████████████████████████▌ | 98/100 [03:46<00:03,  1.68s/it] 99%|██████████████████████████████████████████████████████████████████████▎| 99/100 [03:49<00:01,  1.98s/it]100%|██████████████████████████████████████████████████████████████████████| 100/100 [03:52<00:00,  2.18s/it]100%|██████████████████████████████████████████████████████████████████████| 100/100 [03:52<00:00,  2.32s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             10        
Benchmark duration (s):                  232.07    
Total input tokens:                      101603    
Total generated tokens:                  29842     
Request throughput (req/s):              0.43      
Output token throughput (tok/s):         128.59    
Peak output token throughput (tok/s):    184.00    
Peak concurrent requests:                13.00     
Total Token throughput (tok/s):          566.41    
---------------Time to First Token----------------
Mean TTFT (ms):                          4817.19   
Median TTFT (ms):                        4713.98   
P99 TTFT (ms):                           12820.38  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          58.98     
Median TPOT (ms):                        59.81     
P99 TPOT (ms):                           62.41     
---------------Inter-token Latency----------------
Mean ITL (ms):                           58.86     
Median ITL (ms):                         52.52     
P99 ITL (ms):                            366.10    
==================================================

Script done on 2026-01-29 04:37:22+00:00 [COMMAND_EXIT_CODE="0"]
CSV saved to: ./benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_NVIDIA_Nemotron_3_Nano_30B_A3B_FP8_text_only_samples_100_20260129_043248.csv

Completed: Thu Jan 29 04:37:22 AM UTC 2026


##############################################################
# vLLM TEXT-ONLY BENCHMARK COMPLETE
##############################################################
Results saved to: ./benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_NVIDIA_Nemotron_3_Nano_30B_A3B_FP8_text_only_20260129_043248.txt